app/controllers/album_tags_controller.rb

  def destroy
    @album_tag.destroy
---
DELETE FROM "album_tags" WHERE "album_tags"."id" = $1  [["id", 20]]

    def set_album_tag
      @album_tag = AlbumTag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]