app/controllers/albums_controller.rb

  def random_album_id
    @album = Album.where(dbx_user_id: params[:user_id]).sample
---
SELECT "albums".* FROM "albums" WHERE "albums"."dbx_user_id" = $1  [["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"]]

  def tags_search
    # @albums = Album.where(dbx_user_id: params[:user_id]).joins(:tags).where('tags.tag_string' => params[:album_tags])
    formatted_album_tags = params[:album_tags].split(',')
    @tag_ids = Tag.where('tag_string ILIKE ANY (array[?])', formatted_album_tags).pluck("id")
    @tag_strings = Tag.where('tag_string ILIKE ANY (array[?])', formatted_album_tags).pluck("tag_string")
    @album_tag_ids = AlbumTag.where(tag_id: @tag_ids)
    @album_ids = AlbumTag.where(tag_id: @tag_ids).pluck("album_id")
    @albums = []
    @album_ids.each do | album_id |
      @album_result_tags = Album.find(album_id).tags.pluck("tag_string")
      result = @album_result_tags.all? { |tag| @tag_strings.include? tag}
      if (result)
        @albums.push(album_id)
---
SELECT "tags"."id" FROM "tags" WHERE (tag_string ILIKE ANY (array['map','test']))
SELECT "tags"."tag_string" FROM "tags" WHERE (tag_string ILIKE ANY (array['map','test']))
SELECT "album_tags".* FROM "album_tags" WHERE "album_tags"."tag_id" = $1  [["tag_id", 31]]
SELECT "album_tags"."album_id" FROM "album_tags" WHERE "album_tags"."tag_id" IN ($1, $2, $3)  [["tag_id", 1], ["tag_id", 17], ["tag_id", 44]]
SELECT "album_tags".* FROM "album_tags" WHERE "album_tags"."album_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["album_id", 290], ["album_id", 296], ["album_id", 502], ["album_id", 514], ["album_id", 508], ["album_id", 435], ["album_id", 455], ["album_id", 528], ["album_id", 523], ["album_id", 453]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14)  [["id", 1], ["id", 2], ["id", 19], ["id", 21], ["id", 28], ["id", 38], ["id", 33], ["id", 31], ["id", 32], ["id", 42], ["id", 43], ["id", 44], ["id", 45], ["id", 17]]
SELECT "tags"."tag_string" FROM "tags" INNER JOIN "album_tags" ON "tags"."id" = "album_tags"."tag_id" WHERE "album_tags"."album_id" = $1  [["album_id", 528]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 528], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."tag_string" = $1  [["tag_string", "map,test"]]
INSERT INTO "albums" ("dbx_image_id", "image_name", "image_path", "dbx_user_id", "client_modified_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("dbx_image_id", "image_name", "image_path", "dbx_user_id", "client_modified_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_album
      @album = Album.where(dbx_image_id: params[:dbx_image_id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."dbx_image_id" = $1  [["dbx_image_id", "id:Jo_ZZoosmRAAAAAAAAAAGA"]]