app/controllers/album_tags_controller.rb

  def index
    @album_tags = AlbumTag.all
---
SELECT "tags".* FROM "tags"
SELECT "album_tags".* FROM "album_tags"

  def user_album_tags
    @album_tags = Tag.where(dbx_user_id: params[:user_id]).joins(:album_tags).group(:tag_string).order('COUNT(tag_string) DESC').count
---
SELECT COUNT(*) AS count_all, "tags"."tag_string" AS tags_tag_string FROM "tags" INNER JOIN "album_tags" ON "album_tags"."tag_id" = "tags"."id" WHERE "tags"."dbx_user_id" = $1 GROUP BY "tags"."tag_string" ORDER BY COUNT(tag_string) DESC  [["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"]]

  def create
    @album_id = Album.where(dbx_image_id: params[:album_dbx_image_id]).pluck("id")
    @album_tag = AlbumTag.new(tag_id: album_tag_params[:tag_id], album_id: @album_id[0])

    # render json: params
    # render json: album_tag_params[:tag_id]

    if @album_tag.save
---
SELECT "albums"."id" FROM "albums" WHERE "albums"."dbx_image_id" = $1  [["dbx_image_id", "id:hJnbG6_Z4cMAAAAAAABSzg"]]
INSERT INTO "tags" ("tag_string", "dbx_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_string", "dp"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"], ["created_at", "2020-06-06 00:03:33.988544"], ["updated_at", "2020-06-06 00:03:33.988544"]]
INSERT INTO "album_tags" ("album_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["album_id", 502], ["tag_id", 21], ["created_at", "2020-06-08 02:19:13.419320"], ["updated_at", "2020-06-08 02:19:13.419320"]]

  def destroy_album_tags

    @album_id = Album.where(dbx_image_id: params[:album_dbx_image_id]).pluck("id")
    AlbumTag.where(album_id: @album_id[0]).destroy_all
---
SELECT "albums"."id" FROM "albums" WHERE "albums"."dbx_image_id" = $1  [["dbx_image_id", "id:hJnbG6_Z4cMAAAAAAABSzg"]]
DELETE FROM "album_tags" WHERE "album_tags"."id" = $1  [["id", 27]]
SELECT "album_tags".* FROM "album_tags" WHERE "album_tags"."album_id" = $1  [["album_id", 502]]

    def set_album_tag
      @album_tag = AlbumTag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "album_tags".* FROM "album_tags" WHERE "album_tags"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]