app/controllers/albums_controller.rb

    def set_album
      @album = Album.where(dbx_image_id: params[:dbx_image_id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."dbx_image_id" = $1  [["dbx_image_id", "tags_search"]]