app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."tag_string" = $1 AND "tags"."dbx_user_id" = $2 ORDER BY "tags"."id" ASC LIMIT $3  [["tag_string", "ultimate"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tags" WHERE "tags"."tag_string" = $1 AND "tags"."dbx_user_id" = $2  [["tag_string", "blurst"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_string" = $1 AND "tags"."dbx_user_id" = $2 ORDER BY "tags"."id" ASC LIMIT $3  [["tag_string", "eh"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"], ["LIMIT", 1]]
INSERT INTO "tags" ("tag_string", "dbx_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_string", "tremblant"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"], ["created_at", "2020-06-04 00:59:43.713171"], ["updated_at", "2020-06-04 00:59:43.713171"]]
---
  def create
    # catch if tag_string already exists (and matches same dbx user id)
    if (Tag.where(tag_string: params[:tag][:tag_string]).where(dbx_user_id: params[:user_id]).count > 0)
      # return that record that is already found
      render json: Tag.where(tag_string: params[:tag][:tag_string]).where(dbx_user_id: params[:user_id]).first
    else
      #otherwise create a new tag
      @tag = Tag.new(tag_params)

      if @tag.save