app/controllers/users_controller.rb

INSERT INTO "users" ("last_access_token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "dbx_user_id"  [["last_access_token", "_17QeseHT6IAAAAAAAIdJG9xL_XvkM3y1D601P7a4n2I36GK1y5NGF6-1G7ZBXER"], ["created_at", "2020-06-02 23:34:51.797091"], ["updated_at", "2020-06-02 23:34:51.797091"]]
---
  def create
    @user = User.new(user_params)

    if @user.save